# 第9回 トレース問題
# 最初は実行せず、下の表を紙やノートに書いて完成させましょう。

hps = [10, 40, 25]

for i in range(len(hps)):
    hps[i] = hps[i] - 20
    if hps[i] < 0:
        hps[i] = 0

print(hps)


# 変数の変化
#
# | 処理              | i  | 引く前の hps[i] | 引いた後の hps[i] | 0にした？ | hps          |
# |-------------------|----|-----------------|-------------------|-----------|--------------|
# | 最初              | ―  |       ―         |        ―          |    ―      | [10, 40, 25] |
# | 1回目の繰り返し後 |    |                 |                   |           |              |
# | 2回目の繰り返し後 |    |                 |                   |           |              |
# | 3回目の繰り返し後 |    |                 |                   |           |              |
#
# 最後に表示されるリスト：
#
# 考えよう：for i in range(len(hps)) を for hp in hps に変えると、
#           同じことができる？　できない？　その理由は？
